# Задача №17.
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.

my_list = [1, 1, 2, 0, -1, 3, 4, 4]
my_set = set(my_list)

print(my_set)
print(len(my_set))
